# Gözlem Ve Değişken Seçimi: loc & iloc

In [1]:
import numpy as np
import pandas as pd

In [2]:
m = np.random.randint(1,30,size=(10,3))

In [3]:
df1 = pd.DataFrame(m, columns= ["var1","var2","var3"])

In [4]:
df1

   var1  var2  var3
0    22    13    23
1     6    18     6
2    15    11    23
3    11    17    13
4    21     5    22
5    19     3    23
6     3     2    29
7     1    12    19
8    17    28    14
9    18     2     6

## loc:

Burada alışılmışın dışında seçim yapılır.<br>
Örneğin biz önceden bir veriyi indeks ile seçerken **"0:3"** yazdığımızda **0., 1., 2. indeksleri seçiyorduk**<br>
Ama **loc** metodu ile **"0:3"** yazdığımızda **0., 1., 2., 3. indeksleri seçeriz**

In [9]:
df1
#Dataframe'imizi görelim

   var1  var2  var3
0    22    13    23
1     6    18     6
2    15    11    23
3    11    17    13
4    21     5    22
5    19     3    23
6     3     2    29
7     1    12    19
8    17    28    14
9    18     2     6

In [13]:
df1.loc[0:3]["var2"]

0    13
1    18
2    11
3    17
Name: var2, dtype: int32

In [14]:
df1.loc[0:6]

   var1  var2  var3
0    22    13    23
1     6    18     6
2    15    11    23
3    11    17    13
4    21     5    22
5    19     3    23
6     3     2    29

## iloc:

Alışık olduğumuz şekilde seçim yapar.

In [11]:
df1
#Dataframe'imizi görelim

   var1  var2  var3
0    22    13    23
1     6    18     6
2    15    11    23
3    11    17    13
4    21     5    22
5    19     3    23
6     3     2    29
7     1    12    19
8    17    28    14
9    18     2     6

In [12]:
df1.iloc[0:3]["var1"]

0    22
1     6
2    15
Name: var1, dtype: int32

In [15]:
df1.iloc[0:7]

   var1  var2  var3
0    22    13    23
1     6    18     6
2    15    11    23
3    11    17    13
4    21     5    22
5    19     3    23
6     3     2    29

In [19]:
df1.iloc[:3,:2]

   var1  var2
0    22    13
1     6    18
2    15    11

In [21]:
df1.iloc[0:5,0:1]

   var1
0    22
1     6
2    15
3    11
4    21